Function Reference

# Object Names
| | | |
|---|---|---|
| DelName | GetColorName | GetDashLineTypeName |
| GetDashStyleName <sub>*obsolete in Vectorworks 2019*</sub>| GetName | GetObject |
| Index2Name | Name2Index | NameList |
| NameNum | NameObject | SetColorName |
| SetDashLineTypeName | SetDashStyleName <sub>*obsolete in Vectorworks 2019*</sub>| SetName |